## Title: Mastering Pandas Fundamentals
# Focus: Data Analysis with Python
* Author: Oluwadara Olamide (Dara)
* Email: oluwadaraolamide17@gmail.com

In [1]:
# import Libracies
import numpy as np
import pandas as pd

In [2]:
# Load Datasets
customer = pd.read_csv(r'C:\Users\dell\Downloads\files (4)\customer_data.csv')
employee = pd.read_csv(r'C:\Users\dell\Downloads\files (4)\employee_data.csv')
inventory = pd.read_csv(r'C:\Users\dell\Downloads\files (4)\inventory_data.csv')
sales = pd.read_csv(r'C:\Users\dell\Downloads\files (4)\sales_data.csv')

# SECTION 1: DATAFRAME BASICS
#### Working with DataFrames

In [3]:
# Display the first 10 rows of the sales dataset
sales.head(10)

,date,product,region,sales_rep,quantity,unit_price,discount,total_amount
0,2023-01-01,Camera,East,Carol,19,1243.75,0.00,23631.2500
1,2023-01-01,Headphones,West,Henry,16,1110.66,0.00,17770.5600
2,2023-01-01,Phone,South,Emma,10,938.55,0.05,8916.2250
3,2023-01-01,Tablet,North,Grace,4,107.12,0.10,385.6320
4,2023-01-01,Phone,South,Carol,17,320.63,0.20,4360.5680
5,2023-01-01,Phone,North,Carol,13,1165.70,0.05,14396.3950
6,2023-01-02,Laptop,South,David,7,646.23,0.20,3618.8880
7,2023-01-02,Laptop,North,Frank,13,1018.25,0.00,13237.2500
8,2023-01-02,Smartwatch,East,Henry,11,862.98,0.15,8068.8630
9,2023-01-03,Camera,West,Alice,15,90.39,0.05,1288.0575

In [4]:
# Display the last 5 rows of the customer dataset
customer.tail(5)

,customer_id,name,age,gender,city,signup_date,total_purchases,total_spent
495,496,Customer_496,45,Female,Houston,2021-05-10,38,5268.17
496,497,Customer_497,66,Female,Phoenix,2021-05-11,42,570.99
497,498,Customer_498,56,Female,Houston,2021-05-12,34,1105.43
498,499,Customer_499,31,Other,Los Angeles,2021-05-13,48,2193.89
499,500,Customer_500,38,Female,New York,2021-05-14,45,4643.50

In [5]:
# Show the column names of the employee dataset
employee.columns

Index(['employee_id', 'name', 'department', 'position', 'salary', 'hire_date',
       'performance_score', 'projects_completed'],
      dtype='object')

In [6]:
# Display the shape (rows and columns) of all four datasets
print(f'The customer data has {customer.shape[0]} rows and {customer.shape[1]} columns')
print('The employee data shape {employee.shape[0]} rows and {employee.shape[1]} columns')
print('The inventory data shape {inventory.shape[0]} rows and {inventory.shape[1]} columns')
print('The sales data shape {sales.shape[0]} rows and {sales.shape[1]} columns')

The customer data has 500 rows and 8 columns
The employee data shape {employee.shape[0]} rows and {employee.shape[1]} columns
The inventory data shape {inventory.shape[0]} rows and {inventory.shape[1]} columns
The sales data shape {sales.shape[0]} rows and {sales.shape[1]} columns


#### Data Information and Types

In [7]:
# Display the data types of all columns in the sales dataset
sales.info(type)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          1000 non-null   object
 1   product       1000 non-null   object
 2   region        1000 non-null   object
 3   sales_rep     1000 non-null   object
 4   quantity      1000 non-null   int64
 5   unit_price    1000 non-null   float64
 6   discount      1000 non-null   float64
 7   total_amount  1000 non-null   float64
dtypes: float64(3), int64(1), object(4)
memory usage: 62.6+ KB

In [8]:
# Use `.info()` to get a concise summary of the inventory dataset
inventory.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   product_id         100 non-null    int64
 1   product_name       100 non-null    object
 2   category           100 non-null    object
 3   stock_quantity     90 non-null     float64
 4   reorder_level      100 non-null    int64
 5   supplier           75 non-null     object
 6   unit_cost          86 non-null     float64
 7   last_restock_date  100 non-null    object
dtypes: float64(2), int64(2), object(4)
memory usage: 6.4+ KB

In [9]:
# Check which columns in the inventory dataset have missing values
missing_values = inventory.isna()
# Display columns with missing values
print(missing_values[missing_values > 0].columns)

Index(['product_id', 'product_name', 'category', 'stock_quantity',
       'reorder_level', 'supplier', 'unit_cost', 'last_restock_date'],
      dtype='object')

In [10]:
# Count the total number of missing values in each column of inventory_data
inventory.isna().sum()

product_id            0
product_name          0
category              0
stock_quantity       10
reorder_level         0
supplier             25
unit_cost            14
last_restock_date     0
dtype: int64

#### Summary Statistics:

In [11]:
# Display summary statistics (mean, median, std, etc.) for all numerical columns in the sales dataset
sales.describe()

          quantity   unit_price     discount  total_amount
count  1000.000000  1000.000000  1000.000000   1000.000000
mean      9.994000   762.793900     0.097550   6908.750225
std       5.556153   416.381909     0.070686   5877.146160
min       1.000000    50.040000     0.000000     45.855000
25%       5.000000   392.642500     0.050000   2280.270125
50%      10.000000   758.970000     0.100000   5134.656250
75%      15.000000  1119.460000     0.150000  10052.307500
max      19.000000  1499.360000     0.200000  26960.743500

In [12]:
# Find the minimum and maximum salary in the employee dataset
print(f' The employee ranges of salary is between ${employee['salary'].min()} and ${employee['salary'].max()}')

 The employee ranges of salary is between $30916 and $149712

In [13]:
# Calculate the mean age of customers
print(f'The mean age of customer is {customer['age'].mean()}')

The mean age of customer is 46.284

In [14]:
# Find the total count of products in the inventory dataset
print(f'The total count of products in the inventory is: {inventory['product_id'].count()}')

The total count of products in the inventory is: 100

#### Creating New DataFrames

In [15]:
# Create a new DataFrame with only these columns from sales_data: 'product', 'quantity', 'total_amount'
new_sales = sales[['product','quantity','total_amount']]
new_sales.head(5)

      product  quantity  total_amount
0      Camera        19     23631.250
1  Headphones        16     17770.560
2       Phone        10      8916.225
3      Tablet         4       385.632
4       Phone        17      4360.568

In [16]:
# Create a new DataFrame containing only customers from 'New York'
new_customer = customer[customer['city']=='New York']
new_customer.head(5)

,customer_id,name,age,gender,city,signup_date,total_purchases,total_spent
0,1,Customer_1,46,Female,New York,2020-01-01,1,3823.63
2,3,Customer_3,34,Male,New York,2020-01-03,25,3761.90
10,11,Customer_11,25,Male,New York,2020-01-11,18,2775.23
12,13,Customer_13,41,Other,New York,2020-01-13,47,7235.35
20,21,Customer_21,55,Female,New York,2020-01-21,38,814.74

In [17]:
# Create a DataFrame showing employees in the 'IT' department
new_employee = employee[employee['department']=='IT']
new_employee.head(5)

,employee_id,name,department,position,salary,hire_date,performance_score,projects_completed
0,1,Employee_1,IT,Mid-level,147827,2015-01-04,3.00,25
5,6,Employee_6,IT,Mid-level,72676,2015-02-08,2.62,20
7,8,Employee_8,IT,Senior,108414,2015-02-22,1.77,18
8,9,Employee_9,IT,Mid-level,45120,2015-03-01,1.24,27
10,11,Employee_11,IT,Junior,31986,2015-03-15,4.96,13

# SECTION 2: DATA SELECTION AND INDEXING

#### Basic Selection

In [18]:
# Select the 'product' column from sales_data and display the first 10 values
sales['product'].head(10)

0        Camera
1    Headphones
2         Phone
3        Tablet
4         Phone
5         Phone
6        Laptop
7        Laptop
8    Smartwatch
9        Camera
Name: product, dtype: object

In [19]:
# Select multiple columns: 'name', 'age', 'city' from customer_data
customer[['name','age','city']]

             name  age         city
0      Customer_1   46     New York
1      Customer_2   23      Chicago
2      Customer_3   34     New York
3      Customer_4   43      Phoenix
4      Customer_5   38      Phoenix
..            ...  ...          ...
495  Customer_496   45      Houston
496  Customer_497   66      Phoenix
497  Customer_498   56      Houston
498  Customer_499   31  Los Angeles
499  Customer_500   38     New York

[500 rows x 3 columns]

In [20]:
# Select the first 20 rows from sales_data
sales.head(20)

,date,product,region,sales_rep,quantity,unit_price,discount,total_amount
0,2023-01-01,Camera,East,Carol,19,1243.75,0.00,23631.2500
1,2023-01-01,Headphones,West,Henry,16,1110.66,0.00,17770.5600
2,2023-01-01,Phone,South,Emma,10,938.55,0.05,8916.2250
3,2023-01-01,Tablet,North,Grace,4,107.12,0.10,385.6320
4,2023-01-01,Phone,South,Carol,17,320.63,0.20,4360.5680
5,2023-01-01,Phone,North,Carol,13,1165.70,0.05,14396.3950
6,2023-01-02,Laptop,South,David,7,646.23,0.20,3618.8880
7,2023-01-02,Laptop,North,Frank,13,1018.25,0.00,13237.2500
8,2023-01-02,Smartwatch,East,Henry,11,862.98,0.15,8068.8630
9,2023-01-03,Camera,West,Alice,15,90.39,0.05,1288.0575
10,2023-01-04,Smartwatch,West,Bob,11,1082.60,0.05,11313.1700
11,2023-01-04,Laptop,West,Carol,10,936.62,0.15,7961.2700
12,2023-01-04,Phone,South,Grace,13,687.62,0.15,7598.2010
13,2023-01-04,Camera,South,Alice,7,693.95,0.10,4371.8850
14,2023-01-05,Tablet,South,Carol,5,1244.15,0.20,4976.6000
15,2023-01-05,Tablet,South,Grace,10,303.93,0.05,2887.3350
16,2023-01-05,Tablet,North,Henry,17,1485.98,0.00,25261.6600
17,2023-01-05,Camera,West,David,17,296.33,0.10,4533.8490
18,2023-01-05,Headphones,West,Bob,6,528.91,0.20,2538.7680
19,2023-01-06,Tablet,South,David,5,506.63,0.05,2406.4925

In [21]:
# Select rows 50 to 60 from employee_data
employee.loc[50:60]

,employee_id,name,department,position,salary,hire_date,performance_score,projects_completed
50,51,Employee_51,Marketing,Mid-level,72718,2015-12-20,1.48,31
51,52,Employee_52,Marketing,Mid-level,42500,2015-12-27,3.14,21
52,53,Employee_53,Sales,Junior,41545,2016-01-03,3.70,12
53,54,Employee_54,Sales,Senior,91480,2016-01-10,2.67,46
54,55,Employee_55,IT,Manager,35241,2016-01-17,3.92,22
55,56,Employee_56,Finance,Senior,119314,2016-01-24,3.09,28
56,57,Employee_57,IT,Senior,52821,2016-01-31,1.30,21
57,58,Employee_58,HR,Junior,34695,2016-02-07,1.77,0
58,59,Employee_59,Marketing,Mid-level,107066,2016-02-14,4.36,28
59,60,Employee_60,Marketing,Junior,142616,2016-02-21,3.90,47
60,61,Employee_61,Sales,Senior,147276,2016-02-28,4.58,4

#### Conditional Selection

In [22]:
# Filter sales_data to show only sales where quantity > 10
sales[sales['quantity']>10]

,date,product,region,sales_rep,quantity,unit_price,discount,total_amount
0,2023-01-01,Camera,East,Carol,19,1243.75,0.00,23631.250
1,2023-01-01,Headphones,West,Henry,16,1110.66,0.00,17770.560
4,2023-01-01,Phone,South,Carol,17,320.63,0.20,4360.568
5,2023-01-01,Phone,North,Carol,13,1165.70,0.05,14396.395
7,2023-01-02,Laptop,North,Frank,13,1018.25,0.00,13237.250
...,...,...,...,...,...,...,...,...
987,2023-12-26,Laptop,West,Emma,18,52.89,0.10,856.818
988,2023-12-26,Smartwatch,North,Bob,12,1489.24,0.05,16977.336
996,2023-12-31,Camera,South,Bob,18,1218.29,0.05,20832.759
997,2023-12-31,Smartwatch,West,Carol,13,173.40,0.10,2028.780
999,2023-12-31,Smartwatch,East,Frank,18,1396.85,0.20,20114.640

In [23]:
# Filter customer_data to show customers aged between 30 and 50
filtered_customers = customer[(customer['age'] >= 30) & (customer['age'] <= 50)]

# Display the filtered results
print(filtered_customers)

     customer_id          name  age  gender         city signup_date  \
0              1    Customer_1   46  Female     New York  2020-01-01
2              3    Customer_3   34    Male     New York  2020-01-03
3              4    Customer_4   43    Male      Phoenix  2020-01-04
4              5    Customer_5   38    Male      Phoenix  2020-01-05
6              7    Customer_7   38  Female      Phoenix  2020-01-07
..           ...           ...  ...     ...          ...         ...
490          491  Customer_491   44    Male      Phoenix  2021-05-05
492          493  Customer_493   38  Female      Phoenix  2021-05-07
495          496  Customer_496   45  Female      Houston  2021-05-10
498          499  Customer_499   31   Other  Los Angeles  2021-05-13
499          500  Customer_500   38  Female     New York  2021-05-14

     total_purchases  total_spent
0                  1      3823.63
2                 25      3761.90
3                  5      3673.41
4                 40      5259.47
6                 32      3617.68
..               ...          ...
490               45      4673.87
492               10      9616.11
495               38      5268.17
498               48      2193.89
499               45      4643.50

[175 rows x 8 columns]

In [24]:
# Find all employees with salary greater than $100,000
employee[employee['salary']>100000]

,employee_id,name,department,position,salary,hire_date,performance_score,projects_completed
0,1,Employee_1,IT,Mid-level,147827,2015-01-04,3.00,25
1,2,Employee_2,HR,Junior,142121,2015-01-11,4.36,1
7,8,Employee_8,IT,Senior,108414,2015-02-22,1.77,18
11,12,Employee_12,Marketing,Mid-level,139129,2015-03-22,1.67,23
13,14,Employee_14,Marketing,Senior,137497,2015-04-05,4.12,43
...,...,...,...,...,...,...,...,...
188,189,Employee_189,Marketing,Senior,134177,2018-08-12,4.72,12
190,191,Employee_191,Marketing,Senior,107256,2018-08-26,3.99,40
193,194,Employee_194,HR,Manager,112630,2018-09-16,1.38,30
194,195,Employee_195,Finance,Manager,131999,2018-09-23,2.70,15
195,196,Employee_196,Marketing,Mid-level,130990,2018-09-30,4.73,41

In [25]:
# Show products in inventory where stock_quantity is less than 100
result =inventory[['product_name','stock_quantity']]
result[result['stock_quantity']<100]

   product_name  stock_quantity
9    Product_10            37.0
11   Product_12            44.0
22   Product_23            19.0
28   Product_29            30.0
39   Product_40            18.0
44   Product_45             2.0
53   Product_54             8.0
69   Product_70             3.0
74   Product_75            46.0
75   Product_76            93.0
87   Product_88            72.0
88   Product_89             3.0
89   Product_90            75.0
91   Product_92            76.0
98   Product_99            38.0

#### Advanced Filtering

In [26]:
# Find sales where product is 'Laptop' AND quantity > 5
sales[(sales['product'] == 'Laptop') & (sales['quantity']>5)]

,date,product,region,sales_rep,quantity,unit_price,discount,total_amount
6,2023-01-02,Laptop,South,David,7,646.23,0.20,3618.8880
7,2023-01-02,Laptop,North,Frank,13,1018.25,0.00,13237.2500
11,2023-01-04,Laptop,West,Carol,10,936.62,0.15,7961.2700
21,2023-01-06,Laptop,South,Emma,19,1027.29,0.10,17566.6590
31,2023-01-10,Laptop,East,Alice,17,1023.09,0.15,14783.6505
...,...,...,...,...,...,...,...,...
976,2023-12-23,Laptop,East,Carol,10,59.97,0.05,569.7150
979,2023-12-24,Laptop,North,David,17,634.66,0.05,10249.7590
980,2023-12-24,Laptop,West,David,6,389.03,0.10,2100.7620
982,2023-12-25,Laptop,South,Alice,19,98.83,0.15,1596.1045
987,2023-12-26,Laptop,West,Emma,18,52.89,0.10,856.8180

In [27]:
# Find customers who are either from 'Chicago' OR have total_spent > $5000
customer[(customer['city']=='Chicago') | (customer['total_spent']> 5000)]

,customer_id,name,age,gender,city,signup_date,total_purchases,total_spent
1,2,Customer_2,23,Male,Chicago,2020-01-02,31,4431.27
4,5,Customer_5,38,Male,Phoenix,2020-01-05,40,5259.47
5,6,Customer_6,25,Male,Chicago,2020-01-06,2,8087.99
7,8,Customer_8,74,Male,Houston,2020-01-08,0,5242.55
8,9,Customer_9,28,Female,Los Angeles,2020-01-09,4,6707.27
...,...,...,...,...,...,...,...,...
484,485,Customer_485,30,Other,Chicago,2021-04-29,49,8505.80
485,486,Customer_486,56,Other,Chicago,2021-04-30,24,5505.45
486,487,Customer_487,22,Other,Los Angeles,2021-05-01,2,8258.88
492,493,Customer_493,38,Female,Phoenix,2021-05-07,10,9616.11
495,496,Customer_496,45,Female,Houston,2021-05-10,38,5268.17

In [28]:
# Find employees in 'Sales' OR 'Marketing' departments with salary > $80,000
employee[((employee['department']=='Sales')| (employee['department']=='Marketing')) & (employee['salary']>80000) ]

,employee_id,name,department,position,salary,hire_date,performance_score,projects_completed
11,12,Employee_12,Marketing,Mid-level,139129,2015-03-22,1.67,23
13,14,Employee_14,Marketing,Senior,137497,2015-04-05,4.12,43
19,20,Employee_20,Marketing,Junior,145188,2015-05-17,3.65,40
21,22,Employee_22,Sales,Junior,91918,2015-05-31,3.52,24
30,31,Employee_31,Sales,Manager,108947,2015-08-02,3.88,40
32,33,Employee_33,Marketing,Manager,104716,2015-08-16,4.58,37
36,37,Employee_37,Marketing,Senior,126496,2015-09-13,1.15,21
39,40,Employee_40,Sales,Manager,80906,2015-10-04,1.59,5
40,41,Employee_41,Marketing,Mid-level,81616,2015-10-11,3.99,17
41,42,Employee_42,Sales,Mid-level,138719,2015-10-18,1.03,15
45,46,Employee_46,Sales,Junior,102936,2015-11-15,4.67,12
48,49,Employee_49,Marketing,Senior,102932,2015-12-06,2.58,16
53,54,Employee_54,Sales,Senior,91480,2016-01-10,2.67,46
58,59,Employee_59,Marketing,Mid-level,107066,2016-02-14,4.36,28
59,60,Employee_60,Marketing,Junior,142616,2016-02-21,3.90,47
60,61,Employee_61,Sales,Senior,147276,2016-02-28,4.58,4
62,63,Employee_63,Sales,Manager,80934,2016-03-13,4.96,9
67,68,Employee_68,Sales,Manager,123685,2016-04-17,3.67,34
68,69,Employee_69,Sales,Senior,98754,2016-04-24,1.71,44
93,94,Employee_94,Sales,Junior,111007,2016-10-16,4.56,26
95,96,Employee_96,Marketing,Manager,80016,2016-10-30,4.60,34
97,98,Employee_98,Marketing,Mid-level,93027,2016-11-13,2.95,5
103,104,Employee_104,Marketing,Mid-level,129714,2016-12-25,2.31,23
108,109,Employee_109,Sales,Manager,90848,2017-01-29,2.33,46
112,113,Employee_113,Marketing,Junior,125852,2017-02-26,3.76,30
114,115,Employee_115,Sales,Senior,122044,2017-03-12,1.80,27
116,117,Employee_117,Marketing,Senior,147729,2017-03-26,3.37,17
122,123,Employee_123,Sales,Junior,87275,2017-05-07,4.01,48
126,127,Employee_127,Marketing,Mid-level,87813,2017-06-04,3.57,30
128,129,Employee_129,Marketing,Senior,138220,2017-06-18,3.49,1
130,131,Employee_131,Marketing,Mid-level,134733,2017-07-02,3.00,38
132,133,Employee_133,Marketing,Senior,113551,2017-07-16,2.11,42
135,136,Employee_136,Marketing,Manager,110992,2017-08-06,4.48,16
140,141,Employee_141,Sales,Manager,122615,2017-09-10,3.11,34
141,142,Employee_142,Sales,Mid-level,88830,2017-09-17,3.07,29
148,149,Employee_149,Sales,Manager,125428,2017-11-05,3.12,47
150,151,Employee_151,Sales,Junior,138001,2017-11-19,2.93,19
151,152,Employee_152,Sales,Senior,116649,2017-11-26,1.37,49
153,154,Employee_154,Sales,Mid-level,114739,2017-12-10,3.99,3
154,155,Employee_155,Sales,Senior,92502,2017-12-17,2.25,37
157,158,Employee_158,Sales,Mid-level,96720,2018-01-07,1.29,2
158,159,Employee_159,Sales,Junior,118263,2018-01-14,4.52,36
159,160,Employee_160,Sales,Senior,89155,2018-01-21,2.03,21
162,163,Employee_163,Marketing,Mid-level,89052,2018-02-11,3.71,40
164,165,Employee_165,Sales,Mid-level,131623,2018-02-25,3.76,12
170,171,Employee_171,Marketing,Senior,146211,2018-04-08,2.42,15
171,172,Employee_172,Sales,Mid-level,86361,2018-04-15,1.20,17
172,173,Employee_173,Sales,Manager,91451,2018-04-22,1.12,6
176,177,Employee_177,Sales,Senior,98226,2018-05-20,4.36,29
177,178,Employee_178,Sales,Mid-level,132395,2018-05-27,1.13,41
184,185,Employee_185,Sales,Senior,80044,2018-07-15,4.69,36
185,186,Employee_186,Marketing,Junior,87730,2018-07-22,2.70,1
187,188,Employee_188,Sales,Mid-level,106256,2018-08-05,3.22,47
188,189,Employee_189,Marketing,Senior,134177,2018-08-12,4.72,12
190,191,Employee_191,Marketing,Senior,107256,2018-08-26,3.99,40
195,196,Employee_196,Marketing,Mid-level,130990,2018-09-30,4.73,41
199,200,Employee_200,Sales,Junior,84165,2018-10-28,1.00,31

In [29]:
# Find inventory items where supplier is NOT 'Supplier_A'
inventory[inventory['supplier']!= 'Supplier_A']

,product_id,product_name,category,stock_quantity,reorder_level,supplier,unit_cost,last_restock_date
0,1,Product_1,Food,329.0,67,Supplier_C,176.26,2023-01-01
2,3,Product_3,Electronics,131.0,97,Supplier_C,186.32,2023-01-15
3,4,Product_4,Clothing,354.0,92,Supplier_C,99.34,2023-01-22
6,7,Product_7,Food,430.0,67,Supplier_C,161.52,2023-02-12
7,8,Product_8,Clothing,330.0,37,Supplier_C,53.16,2023-02-19
...,...,...,...,...,...,...,...,...
91,92,Product_92,Food,76.0,63,Supplier_C,NaN,2024-09-29
92,93,Product_93,Electronics,303.0,23,NaN,156.06,2024-10-06
93,94,Product_94,Clothing,255.0,45,NaN,56.64,2024-10-13
95,96,Product_96,Books,101.0,91,Supplier_B,NaN,2024-10-27
99,100,Product_100,Electronics,475.0,74,Supplier_C,125.47,2024-11-24

#### Using .loc and .iloc:

In [30]:
sales.columns

Index(['date', 'product', 'region', 'sales_rep', 'quantity', 'unit_price',
       'discount', 'total_amount'],
      dtype='object')

In [31]:
# Use .loc to select rows where region is 'North' and columns 'product', 'total_amount'
sales.loc[sales['region']=='North',['product','total_amount']]

        product  total_amount
3        Tablet       385.632
5         Phone     14396.395
7        Laptop     13237.250
16       Tablet     25261.660
27       Camera      6427.700
..          ...           ...
985  Headphones     18468.486
988  Smartwatch     16977.336
989      Tablet      1093.600
993      Camera       537.576
998      Camera      5269.600

[265 rows x 2 columns]

In [32]:
# Use .iloc to select the first 10 rows and first 3 columns of customer_data
customer.iloc[:10,:3]
# Use .loc to select specific rows by index (rows 5, 10, 15, 20) from employee_data
# Use .iloc to select every 5th row from sales_data (rows 0, 5, 10, 15, etc.)

   customer_id         name  age
0            1   Customer_1   46
1            2   Customer_2   23
2            3   Customer_3   34
3            4   Customer_4   43
4            5   Customer_5   38
5            6   Customer_6   25
6            7   Customer_7   38
7            8   Customer_8   74
8            9   Customer_9   28
9           10  Customer_10   55

In [33]:
# Use .loc to select specific rows by index (rows 5, 10, 15, 20) from employee_data
employee.loc[5:21:5]

,employee_id,name,department,position,salary,hire_date,performance_score,projects_completed
5,6,Employee_6,IT,Mid-level,72676,2015-02-08,2.62,20
10,11,Employee_11,IT,Junior,31986,2015-03-15,4.96,13
15,16,Employee_16,HR,Mid-level,112966,2015-04-19,4.32,25
20,21,Employee_21,Finance,Senior,114153,2015-05-24,2.86,1

In [34]:
# Use .iloc to select every 5th row from sales_data (rows 0, 5, 10, 15, etc.)
sales.iloc[::5]

,date,product,region,sales_rep,quantity,unit_price,discount,total_amount
0,2023-01-01,Camera,East,Carol,19,1243.75,0.00,23631.250
5,2023-01-01,Phone,North,Carol,13,1165.70,0.05,14396.395
10,2023-01-04,Smartwatch,West,Bob,11,1082.60,0.05,11313.170
15,2023-01-05,Tablet,South,Grace,10,303.93,0.05,2887.335
20,2023-01-06,Camera,West,Frank,19,74.06,0.10,1266.426
...,...,...,...,...,...,...,...,...
975,2023-12-22,Tablet,South,Frank,9,232.05,0.00,2088.450
980,2023-12-24,Laptop,West,David,6,389.03,0.10,2100.762
985,2023-12-26,Headphones,North,Henry,18,1140.03,0.10,18468.486
990,2023-12-27,Camera,West,David,8,820.61,0.15,5580.148
995,2023-12-31,Smartwatch,East,Frank,1,435.60,0.05,413.820

# SECTION 3: DATA CLEANING

#### Identifying Missing Data

In [35]:
# Check if there are any missing values in sales_data (True/False for entire DataFrame)
sales.isnull()

,date,product,region,sales_rep,quantity,unit_price,discount,total_amount
0,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...
995,False,False,False,False,False,False,False,False
996,False,False,False,False,False,False,False,False
997,False,False,False,False,False,False,False,False
998,False,False,False,False,False,False,False,False
999,False,False,False,False,False,False,False,False

In [36]:
# Count how many missing values exist in each column of inventory_data
inventory.isnull().sum()

product_id            0
product_name          0
category              0
stock_quantity       10
reorder_level         0
supplier             25
unit_cost            14
last_restock_date     0
dtype: int64

In [37]:
# Calculate the percentage of missing values for each column in inventory_data\
missing = (inventory.isnull().sum()/len(inventory))*100
missing

product_id            0.0
product_name          0.0
category              0.0
stock_quantity       10.0
reorder_level         0.0
supplier             25.0
unit_cost            14.0
last_restock_date     0.0
dtype: float64

In [38]:
# Identify which rows have missing values in the 'unit_cost' column
inventory[inventory.isnull()]

,product_id,product_name,category,stock_quantity,reorder_level,supplier,unit_cost,last_restock_date
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...
95,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
96,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
97,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
98,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
99,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

#### Handling Missing Data

In [39]:
# Fill missing values in 'stock_quantity' with the median value
inventory['stock_quantity'] = inventory['stock_quantity'].fillna(inventory['stock_quantity'].median())
inventory['stock_quantity']

0     329.0
1     438.0
2     131.0
3     354.0
4     381.0
      ...
95    101.0
96    253.5
97    253.5
98     38.0
99    475.0
Name: stock_quantity, Length: 100, dtype: float64

In [40]:
# Fill missing values in 'unit_cost' with the mean value
inventory['unit_cost']= inventory['unit_cost'].fillna(inventory['stock_quantity'].mean())

In [41]:
# Fill missing values in 'supplier' with the string 'Unknown'
inventory['supplier'] = inventory['supplier'].fillna('Unknown')

In [42]:
# Verify that all missing values have been handled by checking again
print(f' The inventory column suppler as {inventory['supplier'].isna().sum()} missing values, column unit_cost has {inventory['unit_cost'].isna().sum()} and column stock_quantity has {inventory['stock_quantity'].isna().sum()}')

 The inventory column suppler as 0 missing values, column unit_cost has 0 and column stock_quantity has 0

#### Removing Duplicates and Data Cleaning

In [43]:
# Check if there are any duplicate rows in customer_data
customer.duplicated().sum()

0

In [44]:
# If duplicates exist, remove them and show the count before and after
a = customer.duplicated().sum()
customer.dropna(inplace=True)
c= customer.duplicated().sum()
print(f'The duplicated found was {a} and after the droppin of it it remains {c}')

The duplicated found was 0 and after the droppin of it it remains 0

In [45]:
# In sales_data, check for any negative values in 'quantity' or 'total_amount'
sales[(sales['quantity']<0) | (sales['total_amount']<0)]

Empty DataFrame
Columns: [date, product, region, sales_rep, quantity, unit_price, discount, total_amount]
Index: []

In [46]:
# Remove any rows with negative values (if they exist)
numeric = sales.select_dtypes(include=['number']).columns
sales[(sales[numeric]>=0).all(axis=1)]

,date,product,region,sales_rep,quantity,unit_price,discount,total_amount
0,2023-01-01,Camera,East,Carol,19,1243.75,0.00,23631.250
1,2023-01-01,Headphones,West,Henry,16,1110.66,0.00,17770.560
2,2023-01-01,Phone,South,Emma,10,938.55,0.05,8916.225
3,2023-01-01,Tablet,North,Grace,4,107.12,0.10,385.632
4,2023-01-01,Phone,South,Carol,17,320.63,0.20,4360.568
...,...,...,...,...,...,...,...,...
995,2023-12-31,Smartwatch,East,Frank,1,435.60,0.05,413.820
996,2023-12-31,Camera,South,Bob,18,1218.29,0.05,20832.759
997,2023-12-31,Smartwatch,West,Carol,13,173.40,0.10,2028.780
998,2023-12-31,Camera,North,Grace,5,1317.40,0.20,5269.600
999,2023-12-31,Smartwatch,East,Frank,18,1396.85,0.20,20114.640

# SECTION 4: SORTING AND RANKING

#### Basic Sorting:

In [47]:
# Sort sales_data by 'total_amount' in descending order and display top 10
sales.sort_values(by='total_amount',ascending=False).head(10)

,date,product,region,sales_rep,quantity,unit_price,discount,total_amount
722,2023-09-16,Tablet,East,Emma,19,1493.67,0.05,26960.7435
16,2023-01-05,Tablet,North,Henry,17,1485.98,0.00,25261.6600
442,2023-06-10,Phone,South,Frank,18,1385.90,0.00,24946.2000
212,2023-03-22,Headphones,North,Frank,17,1496.56,0.05,24169.4440
28,2023-01-09,Camera,West,Carol,19,1495.91,0.15,24158.9465
469,2023-06-21,Tablet,North,Grace,18,1337.77,0.00,24079.8600
201,2023-03-16,Smartwatch,North,Grace,18,1481.64,0.10,24002.5680
719,2023-09-14,Tablet,West,Emma,18,1403.15,0.05,23993.8650
739,2023-09-22,Smartwatch,East,Grace,19,1400.75,0.10,23952.8250
0,2023-01-01,Camera,East,Carol,19,1243.75,0.00,23631.2500

In [48]:
# Sort customer_data by 'age' in ascending order
customer.sort_values(by='age')

,customer_id,name,age,gender,city,signup_date,total_purchases,total_spent
190,191,Customer_191,18,Other,Los Angeles,2020-07-09,34,9660.21
257,258,Customer_258,18,Other,Houston,2020-09-14,14,3235.25
32,33,Customer_33,18,Other,Chicago,2020-02-02,49,1682.37
373,374,Customer_374,18,Female,Chicago,2021-01-08,37,2532.01
89,90,Customer_90,18,Other,Chicago,2020-03-30,28,6934.01
...,...,...,...,...,...,...,...,...
472,473,Customer_473,74,Male,Chicago,2021-04-17,4,7367.95
324,325,Customer_325,74,Other,Los Angeles,2020-11-20,0,5558.71
113,114,Customer_114,74,Male,New York,2020-04-23,24,9154.16
139,140,Customer_140,74,Male,Houston,2020-05-19,16,324.87
432,433,Customer_433,74,Other,Chicago,2021-03-08,21,9437.74

In [49]:
# Sort employee_data by 'salary' in descending order and show the top 5 earners
employee.sort_values('salary',ascending=False).head(5)

,employee_id,name,department,position,salary,hire_date,performance_score,projects_completed
146,147,Employee_147,IT,Junior,149712,2017-10-22,1.21,3
31,32,Employee_32,IT,Senior,148972,2015-08-09,3.00,27
0,1,Employee_1,IT,Mid-level,147827,2015-01-04,3.00,25
116,117,Employee_117,Marketing,Senior,147729,2017-03-26,3.37,17
60,61,Employee_61,Sales,Senior,147276,2016-02-28,4.58,4

In [50]:
# Sort inventory_data by 'stock_quantity' to find products with lowest stock
inventory.sort_values('stock_quantity')

,product_id,product_name,category,stock_quantity,reorder_level,supplier,unit_cost,last_restock_date
44,45,Product_45,Toys,2.0,68,Supplier_C,74.56,2023-11-05
88,89,Product_89,Toys,3.0,74,Supplier_B,135.47,2024-09-08
69,70,Product_70,Food,3.0,75,Supplier_C,116.52,2024-04-28
53,54,Product_54,Clothing,8.0,80,Unknown,124.61,2024-01-07
39,40,Product_40,Toys,18.0,71,Supplier_A,21.73,2023-10-01
...,...,...,...,...,...,...,...,...
13,14,Product_14,Clothing,463.0,82,Supplier_C,156.81,2023-04-02
48,49,Product_49,Toys,464.0,32,Unknown,51.14,2023-12-03
99,100,Product_100,Electronics,475.0,74,Supplier_C,125.47,2024-11-24
59,60,Product_60,Toys,479.0,53,Supplier_C,86.10,2024-02-18
52,53,Product_53,Clothing,498.0,88,Supplier_C,254.63,2023-12-31

#### Basic Sorting

In [51]:
# Sort sales_data by 'total_amount' in descending order and display top 10
sales.sort_values(by='total_amount', ascending=False).head(10)

,date,product,region,sales_rep,quantity,unit_price,discount,total_amount
722,2023-09-16,Tablet,East,Emma,19,1493.67,0.05,26960.7435
16,2023-01-05,Tablet,North,Henry,17,1485.98,0.00,25261.6600
442,2023-06-10,Phone,South,Frank,18,1385.90,0.00,24946.2000
212,2023-03-22,Headphones,North,Frank,17,1496.56,0.05,24169.4440
28,2023-01-09,Camera,West,Carol,19,1495.91,0.15,24158.9465
469,2023-06-21,Tablet,North,Grace,18,1337.77,0.00,24079.8600
201,2023-03-16,Smartwatch,North,Grace,18,1481.64,0.10,24002.5680
719,2023-09-14,Tablet,West,Emma,18,1403.15,0.05,23993.8650
739,2023-09-22,Smartwatch,East,Grace,19,1400.75,0.10,23952.8250
0,2023-01-01,Camera,East,Carol,19,1243.75,0.00,23631.2500

In [52]:
# Sort customer_data by 'age' in ascending order
customer.sort_values(by= 'age')

,customer_id,name,age,gender,city,signup_date,total_purchases,total_spent
190,191,Customer_191,18,Other,Los Angeles,2020-07-09,34,9660.21
257,258,Customer_258,18,Other,Houston,2020-09-14,14,3235.25
32,33,Customer_33,18,Other,Chicago,2020-02-02,49,1682.37
373,374,Customer_374,18,Female,Chicago,2021-01-08,37,2532.01
89,90,Customer_90,18,Other,Chicago,2020-03-30,28,6934.01
...,...,...,...,...,...,...,...,...
472,473,Customer_473,74,Male,Chicago,2021-04-17,4,7367.95
324,325,Customer_325,74,Other,Los Angeles,2020-11-20,0,5558.71
113,114,Customer_114,74,Male,New York,2020-04-23,24,9154.16
139,140,Customer_140,74,Male,Houston,2020-05-19,16,324.87
432,433,Customer_433,74,Other,Chicago,2021-03-08,21,9437.74

In [53]:
# Sort employee_data by 'salary' in descending order and show the top 5 earners
employee.sort_values(by = 'salary', ascending=False).head(5)

,employee_id,name,department,position,salary,hire_date,performance_score,projects_completed
146,147,Employee_147,IT,Junior,149712,2017-10-22,1.21,3
31,32,Employee_32,IT,Senior,148972,2015-08-09,3.00,27
0,1,Employee_1,IT,Mid-level,147827,2015-01-04,3.00,25
116,117,Employee_117,Marketing,Senior,147729,2017-03-26,3.37,17
60,61,Employee_61,Sales,Senior,147276,2016-02-28,4.58,4

In [54]:
# Sort inventory_data by 'stock_quantity' to find products with lowest stock
inventory.sort_values('stock_quantity')

,product_id,product_name,category,stock_quantity,reorder_level,supplier,unit_cost,last_restock_date
44,45,Product_45,Toys,2.0,68,Supplier_C,74.56,2023-11-05
88,89,Product_89,Toys,3.0,74,Supplier_B,135.47,2024-09-08
69,70,Product_70,Food,3.0,75,Supplier_C,116.52,2024-04-28
53,54,Product_54,Clothing,8.0,80,Unknown,124.61,2024-01-07
39,40,Product_40,Toys,18.0,71,Supplier_A,21.73,2023-10-01
...,...,...,...,...,...,...,...,...
13,14,Product_14,Clothing,463.0,82,Supplier_C,156.81,2023-04-02
48,49,Product_49,Toys,464.0,32,Unknown,51.14,2023-12-03
99,100,Product_100,Electronics,475.0,74,Supplier_C,125.47,2024-11-24
59,60,Product_60,Toys,479.0,53,Supplier_C,86.10,2024-02-18
52,53,Product_53,Clothing,498.0,88,Supplier_C,254.63,2023-12-31

# SECTION 5: GROUPBY AND AGGREGATIONS 

#### Basic Aggregations:

In [55]:
# Group sales_data by 'product' and calculate total quantity sold for each product
sales.groupby(by='product')['quantity'].sum()

product
Camera        1563
Headphones    1549
Laptop        1754
Phone         1765
Smartwatch    1680
Tablet        1683
Name: quantity, dtype: int64

In [56]:
# Group customer_data by 'city' and calculate the mean age in each city
customer.groupby('city')['age'].mean()

city
Chicago        43.304348
Houston        48.406977
Los Angeles    46.818182
New York       46.160000
Phoenix        46.673267
Name: age, dtype: float64

In [57]:
# Group employee_data by 'department' and count how many employees in each department
employee.groupby('department')['employee_id'].count()

department
Finance      33
HR           35
IT           37
Marketing    42
Sales        53
Name: employee_id, dtype: int64

In [58]:
# Group sales_data by 'region' and calculate the sum of total_amount for each region
sales.groupby('region')['total_amount'].sum()

region
East     1.531107e+06
North    1.850944e+06
South    1.797272e+06
West     1.729427e+06
Name: total_amount, dtype: float64

#### Multiple Aggregations:

 * Group sales_data by 'product' and calculate:

In [59]:
# Sum of quantity
quant=sales.groupby(by ='product')
quant['quantity'].sum()

product
Camera        1563
Headphones    1549
Laptop        1754
Phone         1765
Smartwatch    1680
Tablet        1683
Name: quantity, dtype: int64

In [60]:
# Mean of unit_price
quant['unit_price'].mean()

product
Camera        786.862744
Headphones    779.593247
Laptop        771.920588
Phone         748.296471
Smartwatch    782.353609
Tablet        711.193006
Name: unit_price, dtype: float64

In [61]:
# Count of transactions
quant['total_amount'].count()

product
Camera        164
Headphones    154
Laptop        170
Phone         170
Smartwatch    169
Tablet        173
Name: total_amount, dtype: int64

* Group employee_data by 'department' and calculate:

In [62]:
#  Mean salary
emp= employee.groupby('department')
emp['salary'].mean()

department
Finance      81185.666667
HR           97153.200000
IT           89117.918919
Marketing    92974.000000
Sales        83760.679245
Name: salary, dtype: float64

In [63]:
#  Median salary
emp['salary'].median()

department
Finance       79047.0
HR           111641.0
IT            83836.0
Marketing     88432.5
Sales         87275.0
Name: salary, dtype: float64

In [64]:
#  Maximum salary
emp['salary'].max()

department
Finance      144616
HR           144313
IT           149712
Marketing    147729
Sales        147276
Name: salary, dtype: int64

#### Finding Insights with GroupBy:

In [65]:
# Which product has the highest total revenue? (sum of total_amount by product)
Highest_total_revenue = sales.groupby('product')['total_amount'].sum()
Highest_total_revenue.sort_values(ascending= False).head(1)

product
Smartwatch    1192539.155
Name: total_amount, dtype: float64

In [66]:
# Which region has the highest average transaction value?
sales.groupby('region')['total_amount'].median().sort_values(ascending = False).head(1)

region
North    5510.784
Name: total_amount, dtype: float64

In [67]:
# Which department has the highest average salary?
employee.groupby('department')['salary'].median().sort_values(ascending=False).head(1)

department
HR    111641.0
Name: salary, dtype: float64

In [68]:
# Which city has the most customers?
customer.groupby('city')['customer_id'].count().sort_values(ascending= False)

city
Los Angeles    121
Phoenix        101
New York       100
Chicago         92
Houston         86
Name: customer_id, dtype: int64

#### Advanced GroupBy:

In [69]:
# Group sales_data by 'sales_rep' and calculate their total sales (sum of total_amount)
sales_rep = sales.groupby(by='sales_rep')['total_amount'].sum()
sales_rep

sales_rep
Alice    7.943123e+05
Bob      6.550660e+05
Carol    8.592920e+05
David    1.026429e+06
Emma     8.768003e+05
Frank    1.005982e+06
Grace    8.723559e+05
Henry    8.185127e+05
Name: total_amount, dtype: float64

In [70]:
# Rank the sales representatives from best to worst
sales_rep.sort_values( ascending = False)

sales_rep
David    1.026429e+06
Frank    1.005982e+06
Emma     8.768003e+05
Grace    8.723559e+05
Carol    8.592920e+05
Henry    8.185127e+05
Alice    7.943123e+05
Bob      6.550660e+05
Name: total_amount, dtype: float64

In [71]:
# Calculate what percentage of total revenue each sales rep contributed
result = (sales.groupby(by='sales_rep')['total_amount'].sum()/ sales['total_amount'].sum()) *100
# Display the top 5 performing sales representatives
result.head(5)

sales_rep
Alice    11.497192
Bob       9.481685
Carol    12.437734
David    14.856944
Emma     12.691157
Name: total_amount, dtype: float64

# SECTION 6: DATA TRANSFORMATION 

#### Creating New Columns

In [72]:
# In sales_data, create a new column 'revenue_per_unit' = total_amount / quantity
sales['revenue_per_unit'] = sales['total_amount']/sales['quantity']
sales.head()

,date,product,region,sales_rep,quantity,unit_price,discount,total_amount,revenue_per_unit
0,2023-01-01,Camera,East,Carol,19,1243.75,0.00,23631.250,1243.7500
1,2023-01-01,Headphones,West,Henry,16,1110.66,0.00,17770.560,1110.6600
2,2023-01-01,Phone,South,Emma,10,938.55,0.05,8916.225,891.6225
3,2023-01-01,Tablet,North,Grace,4,107.12,0.10,385.632,96.4080
4,2023-01-01,Phone,South,Carol,17,320.63,0.20,4360.568,256.5040

In [73]:
# In customer_data, create a new column 'spending_per_purchase' = total_spent / total_purchases (Handle case where total_purchases is 0)

customer['spending_per_purchase'] = np.where( customer['total_purchases'] == 0, np.nan,  
    customer['total_spent'] / customer['total_purchases']
)
customer.head()

,customer_id,name,age,gender,city,signup_date,total_purchases,total_spent,spending_per_purchase
0,1,Customer_1,46,Female,New York,2020-01-01,1,3823.63,3823.630000
1,2,Customer_2,23,Male,Chicago,2020-01-02,31,4431.27,142.944194
2,3,Customer_3,34,Male,New York,2020-01-03,25,3761.90,150.476000
3,4,Customer_4,43,Male,Phoenix,2020-01-04,5,3673.41,734.682000
4,5,Customer_5,38,Male,Phoenix,2020-01-05,40,5259.47,131.486750

In [74]:
# In employee_data, create a new column 'tenure_category':
    # 'New' if hire_date is after 2020
    # 'Experienced' if hire_date is between 2015 and 2020
    # 'Senior' if hire_date is before 2015
    # Ensure hire_date is in datetime format
employee['hire_date'] = pd.to_datetime(employee['hire_date'])


conditions = [
    employee['hire_date'] > '2020-12-31',  # After 2020
    (employee['hire_date'] >= '2015-01-01') & (employee['hire_date'] <= '2020-12-31'),  # Between 2015 and 2020
    employee['hire_date'] < '2015-01-01'   # Before 2015
]

choices = ['New', 'Experienced', 'Senior']

employee['tenure_category'] = np.select(conditions, choices, default='Unknown')
# Display the first 10 rows showing the new columns
employee.head()

,employee_id,name,department,position,salary,hire_date,performance_score,projects_completed,tenure_category
0,1,Employee_1,IT,Mid-level,147827,2015-01-04,3.00,25,Experienced
1,2,Employee_2,HR,Junior,142121,2015-01-11,4.36,1,Experienced
2,3,Employee_3,Marketing,Manager,44260,2015-01-18,3.81,15,Experienced
3,4,Employee_4,Finance,Junior,95139,2015-01-25,4.16,30,Experienced
4,5,Employee_5,Finance,Senior,31074,2015-02-01,2.40,5,Experienced

#### Data Type Conversions:

In [75]:

# Convert the 'date' column in sales_data to datetime type
sales['date'] = pd.to_datetime(sales['date'])

In [76]:
# Extract the month from the date and create a 'month' column
sales['month'] = sales['date'].dt.month

In [77]:
# Extract the day of week and create a 'day_of_week' column
sales['day_of_week'] = sales['date'].dt.day_name()

In [78]:
# Display summary showing count of sales by month
sales.groupby('month')['total_amount'].sum()

month
1     544964.0730
2     578695.1530
3     535829.3825
4     596458.6395
5     655328.5660
6     631779.5000
7     517038.3260
8     699440.8670
9     589990.7730
10    516983.0860
11    501983.7830
12    540258.0765
Name: total_amount, dtype: float64

#                                      Catch Up with You Soon!!!